InformationRegisters/CounterpartyProductsAndServicesPrices.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>CounterpartyProductsAndServicesPrices</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Price</Name>
					<Comment>Price</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Actuality</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>MeasurementUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.UOMClassifier</v8:Type>
						<v8:Type>cfg:CatalogRef.UOM</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentRecorder</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SupplierInvoice</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>CounterpartyPriceKind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CounterpartyPriceKind</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ProductsAndServices</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsAndServices</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Characteristic</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsAndServicesCharacteristics</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/CounterpartyProductsAndServicesPrices/Forms/RecordForm/Ext/Form/Module.bsl
&AtServerNoContext
// Receives the set of data from the server for the ProductsAndServicesOnChange procedure.
//
Function GetDataProductsAndServicesOnChange(ProductsAndServices)
	
	Return ProductsAndServices.MeasurementUnit;
	
EndFunction // ReceiveDataProductsAndServicesOnChange()	

////////////////////////////////////////////////////////////////////////////////
// PROCEDURE - FORM EVENT HANDLERS

&AtClient
// Procedure - event handler BeforeClose form.
//
Procedure BeforeClose(Cancel, StandardProcessing)
	If RecordWasRecorded Then
		Notify("CounterpartyPriceChanged", RecordWasRecorded);
	EndIf;
EndProcedure

&AtServer
// Procedure - event handler BeforeWrite form.
//
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	
	If Modified Then
		CurrentObject.Author = Users.CurrentUser();
	EndIf; 
	
EndProcedure

&AtClient
// Procedure - event handler AfterWrite form.
//
Procedure AfterWrite(WriteParameters)
	RecordWasRecorded = True;
EndProcedure

&AtServer
// Procedure - event handler OnCreateAtServer of the form.
//
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	RecordWasRecorded = False;
	
	If ValueIsFilled(Record.CounterpartyPriceKind) Then
		Counterparty = Record.CounterpartyPriceKind.Owner;	
	EndIf; 
	
	If Not ValueIsFilled(Record.SourceRecordKey.CounterpartyPriceKind) Then
		
		Record.Author = Users.CurrentUser();
		
		If Parameters.FillingValues.Property("Counterparty") AND ValueIsFilled(Parameters.FillingValues.Counterparty) Then
			Counterparty = Parameters.FillingValues.Counterparty;
		EndIf;
		
		If Parameters.Property("Counterparty") AND ValueIsFilled(Parameters.Counterparty) Then
			Counterparty = Parameters.Counterparty;	
		EndIf;
		
		If Parameters.FillingValues.Property("ProductsAndServices") AND ValueIsFilled(Parameters.FillingValues.ProductsAndServices) Then
			Record.MeasurementUnit = Parameters.FillingValues.ProductsAndServices.MeasurementUnit;	
		EndIf;
		
	EndIf;
	
EndProcedure

&AtClient
// Procedure - event handler OnChange of the ProductsAndServices input field.
//
Procedure ProductsAndServicesOnChange(Item)
	
	Record.MeasurementUnit = GetDataProductsAndServicesOnChange(Record.ProductsAndServices);
	
EndProcedure

&AtClient
// Procedure - event handler StartChoice input field PriceKind.
//
Procedure PriceKindStartChoice(Item, ChoiceData, StandardProcessing)
	
	If Not ValueIsFilled(Counterparty) Then
		
		StandardProcessing = False;
		MessageText = NStr("en='Specify the counterparty to select the prices type.';ru='Укажите контрагента для выбора видов цен.'");
		CommonUseClientServer.MessageToUser(MessageText, , , "Counterparty");
		
	EndIf;
	
EndProcedure // PriceKindStartChoice()







// Rise { Popov N 2016-05-25
&AtClient
Function RiseGetFormInterfaceClient() Export
	Return RiseGetFormInterface();
EndFunction

&AtServer
Function RiseGetFormInterface()
	Return RiseTranslation.GetFormInterface(ThisForm);
EndFunction
// Rise } Popov N 2016-05-25
